russianAlphabet = {'ё', 'я', 'ю', 'э', 'ь', 'ы', 'ъ', 'щ', 'ш', 'ч', 'ц', 'х', 'ф', 'у', 'т', 'с', 'р', 'п', 'о', 'н', 'м', 'л', 'к', 'й', 'и', 'з', 'ж', 'е', 'д', 'г', 'в', 'б', 'а', 'Я', 'Ю', 'Э', 'Ь', 'Ы', 'Ъ', 'Щ', 'Ш', 'Ч', 'Ц', 'Х', 'Ф', 'У', 'Т', 'С', 'Р', 'П', 'О', 'Н', 'М', 'Л', 'К', 'Й', 'И', 'З', 'Ж', 'Е', 'Д', 'Г', 'В', 'Б', 'А', 'Ё'}

russianAlphabetCapitals = {'Г', 'В', 'Б', 'А', 'З', 'Ж', 'Е', 'Д', 'Л', 'К', 'Й', 'И', 'П', 'О', 'Н', 'М', 'У', 'Т', 'С', 'Р', 'Ч', 'Ц', 'Х', 'Ф', 'Ы', 'Ъ', 'Щ', 'Ш', 'Я', 'Ю', 'Э', 'Ь'}

russianVowels = {'я', 'ы', 'у', 'а', 'е', 'и', 'о', 'ю', 'э', 'ё', 'Я', 'Ы', 'У','А', 'Е', 'И', 'О', 'Ю', 'Э', 'Ё'}

russianStopList = {'а', 'б', 'бы', 'в', 'во', 'все', 'всё', 'вы', 'да', 'дак', 'для', 'до', 'его', 'ей', 'ему', 'если', 'ж', 'же', 'за', 'и', 'из', 'им', 'ише', 'их', 'к', 'как', 'ко', 'когда', 'кого', 'кому', 'ли', 'меж', 'между', 'меня', 'мне', 'мной', 'мня', 'моей', 'мой', 'моя', 'мы', 'на', 'надо', 'наш', 'не', 'ней', 'нем', 'ни', 'ним', 'но', 'о', 'об', 'обо', 'он', 'она', 'они', 'от', 'перед', 'передо', 'по', 'под', 'при', 'с', 'сам', 'со', 'тебе', 'тебя', 'тем', 'то', 'тогда', 'той', 'тот', 'тут', 'ты', 'тя', 'у', 'уж', 'чем', 'что', 'я'}

greekAlphabet = {'Α', 'Δ', 'Ε', 'Ζ', 'Η', 'Θ', 'Ι', 'Κ', 'Λ', 'Μ', 'Ν', 'Ο', 'Π', 'Ρ', 'Σ', 'Τ', 'Υ', 'Φ', 'Ω', 'α', 'β', 'γ', 'δ', 'ε', 'ζ', 'η', 'ι', 'κ', 'λ', 'μ', 'ν', 'ξ', 'ο', 'π', 'ρ', 'ς', 'σ', 'τ', 'υ', 'χ', 'ψ', 'ω', 'ϑ', 'ϕ', 'ϱ', 'ἀ', 'ἁ', 'ἂ', 'ἄ', 'ἅ', 'ἐ', 'ἑ', 'ἔ', 'ἕ', 'ἠ', 'ἡ', 'ἢ', 'ἣ', 'ἤ', 'ἥ', 'ἦ', 'ἧ', 'ἰ', 'ἱ', 'ἳ', 'ἴ', 'ἵ', 'ἶ', 'ἷ', 'ὀ', 'ὁ', 'ὃ', 'ὄ', 'ὅ', 'ὐ', 'ὑ', 'ὔ', 'ὕ', 'ὖ', 'ὗ', 'ὠ', 'ὡ', 'ὢ', 'ὣ', 'ὤ', 'ὥ', 'ὦ', 'ὧ', 'ὰ', 'ά', 'ὲ', 'έ', 'ὴ', 'ή', 'ὶ', 'ί', 'ὸ', 'ό', 'ὺ', 'ύ', 'ὼ', 'ώ', 'ᾗ', 'ᾤ', 'ᾧ', 'ᾶ', 'ᾷ', '᾽', 'ῂ', 'ῃ', 'ῆ', 'ῇ', '῎', 'ῖ', '῞', 'ῦ', 'ῳ', 'ῴ', 'ῶ', 'ῷ', '῾'}

greekStopList = {'δ', 'καὶ', 'δὲ', 'τε', 'μὲν', 'οἱ', 'ἐν', 'δέ', 'ὣς', 'τ', 'ἀλλ', 'γὰρ', 'μοι', 'αὐτὰρ', 'ἐπὶ', 'τὸν', 'δὴ', 'τοι', 'ἐπεὶ', 'ἐς', 'ἐνὶ', 'μιν', 'οὐ', 'ὁ', 'κατὰ', 'ἄρα', 'ἄρ', 'τις', 'νῦν', 'ἐκ', 'καί', 'ὡς', 'γε', 'ἦ', 'γάρ', 'οὔ', 'ἐγὼ', 'τι', 'περ', 'ἠδὲ', 'κεν', 'ἐπ', 'οὐκ'}

angloSaxonAlphabet = {'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I', 'L', 'M', 'N', 'O', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'k', 'l', 'm', 'n', 'o', 'p', 'r', 's', 't', 'u', 'w', 'x', 'y', 'æ', 'ð', 'þ'}

angloSaxonStopList = {'on', 'þæt', 'ond', 'he', 'wæs', 'þa', 'him', 'to', 'se', 'ne', 'ic', 'ða', 'þe', 'swa', 'þær', 'his', 'ðe', 'mid', 'æfter', 'ofer', 'ær', 'æt', 'under', 'wið', 'þonne', 'in', 'hie', 'ac', 'þone', 'þæs', 'Ic', 'þu', 'for', 'hine', 'me'}